// pages/rulesDetail/rulesDetail.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    rules:[
      {
        type:'活动时间：',
        desc:'2018年5月4日00：00至5月10日12：00'
      },
      {
        type:'开奖时间：',
        desc:'2018年5月4日至5月10日，每日12：00'
      },
      {
        type:'活动参与方式：',
        desc:'支付一分钱发起抽奖团，并需在规定时间内邀请4位好友助力成团（5人成团），发起人（团长）即可获抽奖活动抽奖资格，并直接参与抽奖； 成团有效时间为该团发起后24小时，成团有效期前未达助力人数则拼团失败，无抽奖机会，支付款项即时自动原路返还； 上一抽奖团未拼满人数时不可发起下一抽奖团； 同一用户每天仅能为同一好友助力一次； 每人每天可发起最多10个拼团； 每人每天可为10位好友助力； 助力好友可在活动期间首次助力时获助力奖励券包一份；'
      },
      {
        type:'奖品与获奖公布：',
        desc:'每日12:00凭抽奖码开奖（5月5日起开奖）； 开奖后，一等奖中奖结果信息每日由小程序服务通知推送； 关注公众号，并回复“1分拼团”，亦可查询当日12点前24小时内成团开奖结果； 退款规则： 超时未拼成团，则团长所支付款项在超时后自动原路返还； 开奖后，未中一等奖团长所支付款项24小时内自动原路返还；'
      },
      {
        type:'其他说明：',
        desc:'本活动优惠不得与其他优惠同时使用。 活动规则限制同一用户参与次数，您须按照本活动规则参与本次活动。 相同的账号、手机号、移动设备、银行卡、支付账户等都将视为同一用户。 活动过程中，任何活动参与方存在虚假交易、恶意套利、作弊等不诚信行为，隐心有权取消活动参与方的活动资格，并保留依法追究法律责任的权利。 若您对本活动规则有任何疑问，隐心将会在法律允许的范围内对本活动规则给与必要的说明和解释。'
      },
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})